DataProcessors/РабочееМестоСотрудникаПроизводства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>РабочееМестоСотрудникаПроизводства</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/NVA_МеткиОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>NVA_МеткиОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Метка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыЗаказовНаПроизводство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыЗаказовНаПроизводство</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоПотолка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаПродажу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТиповоеПроизводство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перезаказ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыНачисленияВыработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СпособыНачисленияВыработки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПроизводственныеОперации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бригадная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Цехи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Цехи</Name>
			<Comment>Производственные точки</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладГотовойПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладМатериалов</Name>
					<Comment>#14812</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеПредставление</Name>
					<Comment>15805</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архивный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Comment>Сотрудники</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_АдресФактическогоПроживания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполняетЗамеры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_КонтактныйТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ЛичныйEMail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ЛичныйТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Неактивный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПроверятьПересечениеЗамеровВГрафике</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ОсновнойEMail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортАдресРегистрации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортКемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортКодПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортСерия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Портал_id</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаботникПроизводства</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифМонтажа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифыИсполнителей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиПродаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фото</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветМеткиЗамераНаКартеЯндекс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЦветаМетокЯндексКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПраваПодписи</Name>
					<Comment>#4051</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокументаПраваПодписи</Name>
					<Comment>#4051</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокументаПраваПодписи</Name>
					<Comment>#4051</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасшифровкаПодписи</Name>
					<Comment>#4051</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоВыполняемыхНормоЧасовМонтажаЗаЧасВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/РабочееМестоСотрудникаПроизводства/Forms/ШКИсполнители/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	//++17110
	Если Метаданные.Версия < "3.3.0" И ТекущийПользователь.УДАЛИТЬ_РазрешеноРедактироватьМатериалыЗаказаНаПроизводство Тогда
		// Взводим нужный флаг
		ОбъектПользователь = ТекущийПользователь.ПолучитьОбъект();
		ОбъектПользователь.РазрешитьИзменениеКоличестваПриВыпускеВРМСотрудникаПроизводства = Истина;
		ОбъектПользователь.УДАЛИТЬ_РазрешеноРедактироватьМатериалыЗаказаНаПроизводство = Ложь;
		ОбъектПользователь.ОбменДанными.Загрузка = Истина;
		ОбъектПользователь.Записать();
	КонецЕсли;
	
	РеквизитыПользователя = ОбщийМодульСервер.НастройкиПользователя("РазрешитьИзменениеМатериаловИИхКоличестваВЗнПвРМСП, 
																	|РазрешитьИзменениеКоличестваПриВыпускеВРМСотрудникаПроизводства", ТекущийПользователь);
		
	ИспользоватьПодключаемоеОборудование = Константы.ИспользоватьПодключаемоеОборудование.Получить();
	ШКСотрудникаСодержитКодОперации = Истина; //Константы.ШтрихкодСотрудникаСодержитКодОперации.Получить();  // #13536
	ПоПроизводственнымОперациям = Константы.РасчетЗарплатыПроизводстваПоОперациям.Получить();
	
	//++ №14141 количество колонок по производственным операциям
	МаксимальноеКоличествоСотрудниковВВыпускеНаОперацию = Константы.МаксимальноеКоличествоСотрудниковВВыпускеНаОперацию.Получить();
	
	Для Сч = 1 По 4 Цикл
		Элементы["ИсполнителиПоОперациямСотрудник" + Сч].Видимость = (Сч <= МаксимальноеКоличествоСотрудниковВВыпускеНаОперацию);
	КонецЦикла;
	//-- №14141
	
	//++ #15805
	Элементы.ГруппаЗаказы.Видимость = Константы.ВыводитьСписокЗаказовНаПроизводствоВРМСотрудникаПроизводства.Получить();
	
	Если ПолучитьФункциональнуюОпцию("НесколькоТочекПроизводства") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Цехи.Ссылка КАК Ссылка,
		|	Цехи.Код КАК Код1,
		|	Цехи.Наименование КАК Наименование,
		|	Цехи.КраткоеПредставление КАК КраткоеПредставление,
		|	Цехи.Код КАК Код
		|ИЗ
		|	Справочник.Цехи КАК Цехи
		|ГДЕ
		|	НЕ Цехи.Архивный
		|	И НЕ Цехи.ПометкаУдаления";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ДобавитьКомандуИКнопкуОтбораПоЦеху(Выборка.Ссылка, Выборка.Код, Выборка.Наименование, Выборка.КраткоеПредставление);	
		КонецЦикла;
			
	КонецЕсли;
	
	ВосстановитьНастройкиФормы();	
	УстановитьОтборЗаказов();
	//-- #15805
	
	//#16317
	Элементы.ЗаменитьМатериал.Видимость     = РеквизитыПользователя.РазрешитьИзменениеМатериаловИИхКоличестваВЗнПвРМСП ИЛИ РеквизитыПользователя.РазрешитьИзменениеКоличестваПриВыпускеВРМСотрудникаПроизводства;
	Элементы.ИзменитьКоличество.Видимость   = РеквизитыПользователя.РазрешитьИзменениеМатериаловИИхКоличестваВЗнПвРМСП ИЛИ РеквизитыПользователя.РазрешитьИзменениеКоличестваПриВыпускеВРМСотрудникаПроизводства;
	Элементы.ЗаменитьМатериал1.Видимость    = РеквизитыПользователя.РазрешитьИзменениеМатериаловИИхКоличестваВЗнПвРМСП ИЛИ РеквизитыПользователя.РазрешитьИзменениеКоличестваПриВыпускеВРМСотрудникаПроизводства;
	Элементы.ИзменитьКоличество1.Видимость  = РеквизитыПользователя.РазрешитьИзменениеМатериаловИИхКоличестваВЗнПвРМСП ИЛИ РеквизитыПользователя.РазрешитьИзменениеКоличестваПриВыпускеВРМСотрудникаПроизводства;
	Элементы.ИзОстатков.Видимость 			= РеквизитыПользователя.РазрешитьИзменениеМатериаловИИхКоличестваВЗнПвРМСП ИЛИ РеквизитыПользователя.РазрешитьИзменениеКоличестваПриВыпускеВРМСотрудникаПроизводства;
	Элементы.ИзМатериалаЗаказчика.Видимость = РеквизитыПользователя.РазрешитьИзменениеМатериаловИИхКоличестваВЗнПвРМСП ИЛИ РеквизитыПользователя.РазрешитьИзменениеКоличестваПриВыпускеВРМСотрудникаПроизводства;
		
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаНачальнаяСтраница;
	ТекущийЭлемент = Элементы.ИмитацияШК; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//ОбновитьСостояние();
	
	МенеджерОборудованияКлиентПереопределяемый.НачатьПодключениеОборудованиеПриОткрытииФормы(ЭтаФорма, "СканерШтрихкода");
	
	ВыделитьКнопкиОтбораЗаказаПоСтатусу();
	ВыделитьКнопкиОтбораЗаказаПоЦеху();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	МенеджерОборудованияКлиентПереопределяемый.НачатьОтключениеОборудованиеПриЗакрытииФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда 
		Если ИмяСобытия = "ScanData" Тогда
			ОчиститьСообщения();
			ОбработатьШтрихкоды(МенеджерОборудованияПотолкиКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр));
			//ОбновитьСостояние();
			
			ПодключитьОбработчикОжидания("УстановитьТекущийЭлемент", 0.1, Истина);
		КонецЕсли;	
	КонецЕсли; 
		
КонецПроцедуры

#КонецОбласти

#Область ШтрихкодыИТорговоеОборудование

&НаКлиенте
Процедура ОбработатьШтрихкоды(Данные)
	
	ШК = Данные.Штрихкод; // Штрихкод[0].Штрихкод;
	
	Если ПустаяСтрока(ШК) Тогда
		//ПоказатьПредупреждение(,"Штрих-код не распознан");
		ОткрытьФорму("ОбщаяФорма.ФормаПредупреждения", Новый Структура("ЗаголовокИнформации, ТекстИнформации, Состояние", "Ошибка", "Штрих-код не распознан", "Ошибка"));			
		Возврат;
	КонецЕсли;
	
	//Если ЗаказНаПроизводство.Пустая() Тогда
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаНачальнаяСтраница Тогда
		//Отсканировали ШК заказа	
		
		СсылкаНаЗаказНаПроизводство = ПолучитьЗаказНаПроизводство(ШК);
		Если НЕ СсылкаНаЗаказНаПроизводство.Пустая() Тогда			
			ВыборДокументаФрагмент(СсылкаНаЗаказНаПроизводство);
		Иначе			
			//Сообщить("Не найден заказ на производство в статусе ""В производстве"" с номером расчета " + ШК);
			//ДобавитьВИсторию("Не найден заказ на производство в статусе ""В производстве"" с номером расчета " + ШК);
			ТекстСообщения = "Не найдена уникальная продукция с номером " + ШК + " с заказом на производство в статусе ""В ПРОИЗВОДСТВЕ""";
			//ПоказатьПредупреждение(,ТекстСообщения);
			ОткрытьФорму("ОбщаяФорма.ФормаПредупреждения", Новый Структура("ЗаголовокИнформации, ТекстИнформации, Состояние", "Ошибка", ТекстСообщения, "Ошибка"));
		КонецЕсли;		
		
	Иначе

		//#14336
		Если Лев(ШК, 12) = "000000000000" Тогда
			Отмена(Неопределено);
			Возврат;
		ИначеЕсли Лев(ШК, 12) = "000000000001" Тогда
			ОК(Неопределено);
			Возврат;
		КонецЕсли;
		
		ШК_ИД = Лев(ШК, 2);
		// #13536 изменена процедура: раньше ШК всегда начиналась с 88, сейчас с 86/87/88
		ДанныеПоШК = ШтрихкодированиеПотолкиКлиент.ОбработатьШтрихкод(ШК);
		Если ДанныеПоШК = Неопределено Тогда
			Возврат;
		КонецЕсли;
	
		Если ШК_ИД = "87" Тогда //ПоПроизводственнымОперациям И ПроизводственнаяОперация.Пустая() И НЕ ШКСотрудникаСодержитКодОперации Тогда
			//Отсканировали ШК операции
			
			//ШКОперации = Сред(ШК, 3, 5);	
			//Результат = ПолучитьПроизводственнуюОперацию(Строка("0000" + ШКОперации));
			//Если ТипЗнч(Результат) = тип("Строка") Тогда
			//	ПоказатьПредупреждение(,Результат);
			//Иначе
			//	ПроизводственнаяОперация = Результат;
			//КонецЕсли;
			
			ПроизводственнаяОперация = ДанныеПоШК.Операция;
			
		ИначеЕсли ШК_ИД = "88" Тогда //ПоПроизводственнымОперациям И ПроизводственнаяОперация.Пустая() И ШКСотрудникаСодержитКодОперации Тогда	
			//Отсканировали ШК операции+сотрудника (единый)
			
			//ШКОперации = Сред(ШК, 3, 5);		
			//Результат = ПолучитьПроизводственнуюОперацию(Строка("0000" + ШКОперации));
			//Если ТипЗнч(Результат) = тип("Строка") Тогда
			//	ПоказатьПредупреждение(,Результат);
			//	Возврат;
			//Иначе
			//	ПроизводственнаяОперация = Результат;
			//КонецЕсли;
			//
			//ШКСотрудника = Сред(ШК, 8, 5);		
			//Результат = ПолучитьСотрудника(Строка("0000" + ШКСотрудника));
			//Если ТипЗнч(Результат) = тип("Строка") Тогда
			//	ПоказатьПредупреждение(,Результат);
			//Иначе
			//	Сотрудник = Результат;
			//КонецЕсли;
			
			ПроизводственнаяОперация = ДанныеПоШК.Операция;
			Сотрудник = ДанныеПоШК.Сотрудник;
			
			//#13729
			Если НЕ ЭтоРаботникПроизводства(Сотрудник) Тогда
				ПроизводственнаяОперация = ПредопределенноеЗначение("Справочник.ПроизводственныеОперации.ПустаяСсылка");
				Сотрудник = ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка");
				Возврат;
			КонецЕсли;
				
			Результат = ДобавитьИсполнителяВСхемеПоОперациям();
			Если Не ПустаяСтрока(Результат) Тогда
				ПоказатьПредупреждение(,Результат);
			КонецЕсли;
			
		ИначеЕсли ШК_ИД = "86" Тогда //Сотрудник.Пустая() Тогда	
			//Отсканировали ШК сотрудника
			
			//ШКСотрудника = Сред(ШК, 8, 5);		
			//Результат = ПолучитьСотрудника(Строка("0000" + ШКСотрудника));
			//Если ТипЗнч(Результат) = тип("Строка") Тогда
			//	ПоказатьПредупреждение(, Результат);
			//	Возврат;
			//Иначе
			//	Сотрудник = Результат;
			//КонецЕсли;
			
			Сотрудник = ДанныеПоШК.Сотрудник;
			
			//#13729
			Если НЕ ЭтоРаботникПроизводства(Сотрудник) Тогда
				Сотрудник = ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка");
				Возврат;
			КонецЕсли;

			Если ПоПроизводственнымОперациям Тогда
				Результат = ДобавитьИсполнителяВСхемеПоОперациям();
			Иначе
				Результат = ДобавитьИсполнителяВБригаднойСхеме();
			КонецЕсли;
			Если Не ПустаяСтрока(Результат) Тогда
				ПоказатьПредупреждение(, Результат);
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ИмитацияШКПриИзменении(Элемент)
	
	ПараметрыКОтправке = Новый Массив;
	ПараметрыКОтправке.Добавить(ИмитацияШК);
	ПараметрыКОтправке.Добавить(Неопределено);
	ОбработкаОповещения("ScanData", ПараметрыКОтправке, "ПодключаемоеОборудование");
	ИмитацияШК = "";
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	//Если НЕ ЗаказНаПроизводство.Пустая() Тогда
		ТекстОшибки = ЗаполнитьЗаказНаПроизводствоНаСервере();
		Если ПустаяСтрока(ТекстОшибки) Тогда
			ОчиститьВсеПоляНаФорме();
		Иначе
			ПоказатьПредупреждение(, ТекстОшибки);
		КонецЕсли;
	//Иначе
	//	ПоказатьПредупреждение(,"Не выбрана продукция");
	//КонецЕсли;
	
	ПодключитьОбработчикОжидания("УстановитьТекущийЭлемент", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	ОчиститьВсеПоляНаФорме();
	ПодключитьОбработчикОжидания("УстановитьТекущийЭлемент", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Выполнен(Команда)
	
	//Если ЗаказНаПроизводство.Пустая() Тогда
	//	ПоказатьПредупреждение(,"Не указана продукция");
	//Иначе
		ТекстОшибки = ЗаполнитьЗаказНаПроизводствоНаСервере();

		Если ПустаяСтрока(ТекстОшибки) Тогда		
			
			//#13345
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("ЗаказНаПроизводство",    ЗаказНаПроизводство);
			ДополнительныеПараметры.Вставить("ПредставлениеПродукции", ПредставлениеПродукции);
			ОписаниеОповещения = Новый ОписаниеОповещения("ВыполненЗавершение", ЭтотОбъект, ДополнительныеПараметры);
			ОткрытьФорму("Обработка.РабочееМестоСотрудникаПроизводства.Форма.ШКИсполнителиВыпуск", ДополнительныеПараметры, ЭтаФорма, , , , ОписаниеОповещения);
			
		Иначе
			ПоказатьПредупреждение(, ТекстОшибки);
		КонецЕсли;
	//КонецЕсли;
	
	ПодключитьОбработчикОжидания("УстановитьТекущийЭлемент", 0.1, Истина);
	
КонецПроцедуры

//#16317
&НаКлиенте
Процедура ЗаменитьМатериал(Команда)
	
	Если Команда.Имя = "ЗаменитьМатериал" Тогда
		Элемент = Элементы.Материалы;
		
	ИначеЕсли Команда.Имя = "ЗаменитьМатериал1" Тогда
		Элемент = Элементы.Материалы1;
	КонецЕсли;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
		
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторСтроки = Элемент.ТекущаяСтрока;
	ПредыдущийМатериал = ТекущиеДанные.Номенклатура;
	
	ПараметрыФормы = Новый Структура("ТекущаяСтрока", ТекущиеДанные.Номенклатура);
	//ДополнительныеПараметры = Новый Структура("ИдентификаторСтроки", ТекущиеДанные.ПолучитьИдентификатор());
	ДополнительныеПараметры = Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки);
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаменитьМатериалФрагмент", ЭтотОбъект, ДополнительныеПараметры);
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаВыбораДляСотрудникаПроизводства", ПараметрыФормы,,,,, ОписаниеОповещения); 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьМатериалФрагмент(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МатериалыИзменены = Истина;
	
	СтрокаТабличнойЧасти = Материалы.НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторСтроки);
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	СтрокаТабличнойЧасти.Номенклатура = ВыбранноеЗначение;
	МатериалыНоменклатураПриИзменении(СтрокаТабличнойЧасти);
	
	ИзменитьКоличествоМатериалаИнтерактивно(СтрокаТабличнойЧасти, ДополнительныеПараметры.ИдентификаторСтроки);
	
КонецПроцедуры	

&НаКлиенте
Процедура МатериалыНоменклатураПриИзменении(СтрокаТабличнойЧасти)
	
	СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;
	СтрокаТабличнойЧасти.ЕдиницаИзмерения = ОбщийМодульВызовСервера.ПолучитьЕдиницуИзмеренияДляПроизводства(СтрокаТабличнойЧасти.Номенклатура);
	
	Если ЗначениеЗаполнено(ПредыдущийМатериал) И СтрокаТабличнойЧасти.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ОстаткиПленки") Тогда
		СтрокаТабличнойЧасти.Количество = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Коэффициент;
		СтрокаТабличнойЧасти.Коэффициент = 1;
	Иначе		
		Если ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
			СтрокаТабличнойЧасти.Коэффициент = 1;
		ИначеЕсли ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.ЕдиницыИзмерений") Тогда
			СтрокаТабличнойЧасти.Коэффициент = ОбщийМодульВызовСервера.ПолучитьКоэффициентЕдиницыИзмерения(СтрокаТабличнойЧасти.ЕдиницаИзмерения);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

//#16317
&НаКлиенте
Процедура ИзменитьКоличество(Команда)
	
	Если Команда.Имя = "ИзменитьКоличество" Тогда
		Элемент = Элементы.Материалы;
		
	ИначеЕсли Команда.Имя = "ИзменитьКоличество1" Тогда
		Элемент = Элементы.Материалы1;
	КонецЕсли;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторСтроки = Элемент.ТекущаяСтрока;	
	ИзменитьКоличествоМатериалаИнтерактивно(ТекущиеДанные, ИдентификаторСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьКоличествоМатериалаИнтерактивно(ТекущиеДанные, ИдентификаторСтроки)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок", "Введите количество");
	ПараметрыФормы.Вставить("ЧислоВвода", ТекущиеДанные.Количество);
	ПараметрыФормы.Вставить("КоличествоСимволовПослеЗапятой", 3);
	
	ДополнительныеПараметры = Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ИзменитьКоличествоЗавершение", ЭтотОбъект, ДополнительныеПараметры);	
	ОткрытьФорму("Обработка.РабочееМестоСотрудникаПроизводства.Форма.ФормаВводаЧисла", ПараметрыФормы,,,,, ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьКоличествоЗавершение(РезультатОткрытияФормы, ДополнительныеПараметры) Экспорт
	
	СтрокаТабличнойЧасти = Материалы.НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторСтроки);
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ РезультатОткрытияФормы = Неопределено Тогда
		СтрокаТабличнойЧасти.Количество = РезультатОткрытияФормы.ВведенноеЧисло;
		МатериалыИзменены = Истина;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОтборыЗаказов

//++ #15805
&НаСервере
Процедура УстановитьОтборЗаказов()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокЗаказов,
			"ТекущийСтатус", ЗаказОтборПоТекущемуСтатусу, ВидСравненияКомпоновкиДанных.ВСписке,, ЗаказОтборПоТекущемуСтатусу.Количество() > 0);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокЗаказов,
			"Цех", ЗаказОтборПоЦеху, ВидСравненияКомпоновкиДанных.ВСписке,, ЗаказОтборПоЦеху.Количество() > 0);
	
	//nva+++
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокЗаказов,
			"СкладМатериалов", ЗаказОтборПоСкладуМатериалов, ВидСравненияКомпоновкиДанных.ВСписке,, ЗаказОтборПоСкладуМатериалов.Количество() > 0);
	//nva---
	
	СохранитьНастройкиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗаказовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.СписокЗаказов.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ТекущиеДанные.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЗаказовНаПроизводство.ВПроизводстве")
		ИЛИ НЕ ТекущиеДанные.Проведен Тогда
		//ПоказатьЗначение(, ТекущиеДанные.Ссылка);
		ТекстСообщения = "Заказ на производство не проведен или не находится в статусе ""В ПРОИЗВОДСТВЕ""";
		ОткрытьФорму("ОбщаяФорма.ФормаПредупреждения", Новый Структура("ЗаголовокИнформации, ТекстИнформации, Состояние", "Ошибка", ТекстСообщения, "Ошибка"));
		Возврат;
	КонецЕсли;
	
	ВыборДокументаФрагмент(ТекущиеДанные.Ссылка);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьМассивРеквизитовСтатусыЗаказа()
	
	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить("ВПроизводстве");
	МассивРеквизитов.Добавить("Произведен");
	МассивРеквизитов.Добавить("Отменен");
		
	Возврат МассивРеквизитов;
	
КонецФункции

&НаКлиенте
Процедура ОтборЗаказаПоСтатусуНажатие(Команда)
	
	Элементы[Команда.Имя].Пометка = НЕ Элементы[Команда.Имя].Пометка;
	
	ВыделитьКнопкиОтбораЗаказаПоСтатусу();
	ОтборЗаказаПоСтатусу();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборЗаказаПоСтатусу()
	
	МассивРеквизитов = ПолучитьМассивРеквизитовСтатусыЗаказа();	
	ЗаказОтборПоТекущемуСтатусу.Очистить();	
	Для каждого ИмяРеквизита Из МассивРеквизитов Цикл
		
		Если Элементы["ОтборСтатусЗаказа" + ИмяРеквизита].Пометка Тогда
			
			ЗаказОтборПоТекущемуСтатусу.Добавить(ПредопределенноеЗначение("Справочник.СтатусыЗаказовНаПроизводство." + ИмяРеквизита));
			
		КонецЕсли;
		
	КонецЦикла;	
	УстановитьОтборЗаказов();
	
КонецПроцедуры 

&НаКлиенте
Процедура ВыделитьКнопкиОтбораЗаказаПоСтатусу()
	
	МассивРеквизитов = ПолучитьМассивРеквизитовСтатусыЗаказа();
	
	Для каждого ИмяРеквизита Из МассивРеквизитов Цикл		
		ЭлементКнопка = Элементы["ОтборСтатусЗаказа" + ИмяРеквизита];
		ЭлементКнопка.ЦветФона = ?(ЭлементКнопка.Пометка, WebЦвета.Оранжевый, WebЦвета.СветлоЖелтыйЗолотистый);		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьМассивРеквизитовСкладыМатериалов()
	
	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить("Юг");
	МассивРеквизитов.Добавить("Север");
		
	Возврат МассивРеквизитов;
	
КонецФункции

&НаКлиенте
Процедура ОтборПоСкладуМатериаловНажатие(Команда)
	
	Элементы[Команда.Имя].Пометка = НЕ Элементы[Команда.Имя].Пометка;
	
	ВыделитьКнопкиОтбораЗаказаПоСкладуМатериалов();
	ОтборЗаказаПоСкладуМатериалов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборЗаказаПоСкладуМатериалов()
	
	МассивРеквизитов = ПолучитьМассивРеквизитовСкладыМатериалов();	
	ЗаказОтборПоСкладуМатериалов.Очистить();	
	Для каждого ИмяРеквизита Из МассивРеквизитов Цикл
		
		Если Элементы["ОтборПоСкладуМатериалов" + ИмяРеквизита].Пометка Тогда
			Если ИмяРеквизита = "Юг" Тогда
				Склад = ПолучитьСкладЮг();
			ИначеЕсли ИмяРеквизита = "Север" Тогда
				Склад = ПолучитьСкладСевер();
			Иначе
				Склад = Неопределено;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Склад) Тогда
				ЗаказОтборПоСкладуМатериалов.Добавить(Склад);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;	
	УстановитьОтборЗаказов();
	
КонецПроцедуры

Функция ПолучитьСкладЮг()
	
	Возврат Справочники.Склады.НайтиПоКоду("000000001");
	
КонецФункции

Функция ПолучитьСкладСевер()
	
	Возврат Справочники.Склады.НайтиПоКоду("000000004");
	
КонецФункции

&НаКлиенте
Процедура ВыделитьКнопкиОтбораЗаказаПоСкладуМатериалов()
	
	МассивРеквизитов = ПолучитьМассивРеквизитовСкладыМатериалов();
	
	Для каждого ИмяРеквизита Из МассивРеквизитов Цикл		
		ЭлементКнопка = Элементы["ОтборПоСкладуМатериалов" + ИмяРеквизита];
		ЭлементКнопка.ЦветФона = ?(ЭлементКнопка.Пометка, WebЦвета.Оранжевый, WebЦвета.СветлоЖелтыйЗолотистый);		
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ОтборПоЦехуНажатие(Команда)
	
	Элементы[Команда.Имя].Пометка = НЕ Элементы[Команда.Имя].Пометка;
	
	ВыделитьКнопкиОтбораЗаказаПоЦеху();	
	ОтборЗаказаПоЦеху();

КонецПроцедуры

&НаКлиенте
Процедура ВыделитьКнопкиОтбораЗаказаПоЦеху()
	
	Для каждого СтрокаТЗ Из КомандыЦехов Цикл		
		ЭлементКнопка = Элементы[СтрокаТЗ.ИмяКоманды];
		ЭлементКнопка.ЦветФона = ?(ЭлементКнопка.Пометка, WebЦвета.Оранжевый, WebЦвета.СветлоЖелтыйЗолотистый);	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборЗаказаПоЦеху()
		
	ЗаказОтборПоЦеху.Очистить();	
	Для каждого СтрокаТЗ Из КомандыЦехов Цикл		
		Если Элементы[СтрокаТЗ.ИмяКоманды].Пометка Тогда			
			ЗаказОтборПоЦеху.Добавить(СтрокаТЗ.Цех);			
		КонецЕсли;		
	КонецЦикла;	
	УстановитьОтборЗаказов();
	
КонецПроцедуры
//-- #15805

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаКлиенте
Процедура УстановитьТекущийЭлемент()
	
	//ТекущийЭлемент = Элементы.ИмитацияШК;
		
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаНачальнаяСтраница Тогда
		ТекущийЭлемент = Элементы.ИмитацияШК;
		
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПроизводственныеОперации Тогда
		ТекущийЭлемент = Элементы.ИмитацияШК1;
		
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСотрудник Тогда
		ТекущийЭлемент = Элементы.ИмитацияШК2;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьВсеПоляНаФорме()
	
	НоменклатураПродукции = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
	ПредставлениеПродукции = "";
	ЗаказНаПроизводство 			= ПредопределенноеЗначение("Документ.ЗаказНаПроизводство.ПустаяСсылка");
	ПроизводственнаяОперация 		= ПредопределенноеЗначение("Справочник.ПроизводственныеОперации.ПустаяСсылка");
	Сотрудник 						= ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка");
	
	Исполнители.Очистить();
	ИсполнителиПоОперациям.Очистить();
	
	Материалы.Очистить();
	
	//ОбновитьСостояние();
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаНачальнаяСтраница;
	
КонецПроцедуры

&НаКлиенте	
Процедура ВыборЗаказНаПроизводствоЗавершение(СсылкаНаЗаказНаПроизводство)

	ЗаказНаПроизводство = СсылкаНаЗаказНаПроизводство;
	ПолучитьНоменклатуруПродукцииИзЗаказаНаПроизводство(ЗаказНаПроизводство, НоменклатураПродукции, ПредставлениеПродукции);
	ЗаполнитьИсполнителейПоЗаказуНаПроизводство();
	ЗаполнитьМатериалыПоЗаказуНаПроизводство(); //#16317
	//ОбновитьСостояние();
	
	Если ПоПроизводственнымОперациям Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПроизводственныеОперации;
		Элементы.ОК.КнопкаПоУмолчанию = Истина;
	Иначе
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСотрудник;
		Элементы.ОК1.КнопкаПоУмолчанию = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ЭтоРаботникПроизводства(Сотрудник)

	ЭтоРаботникПроизводства = ОбщийМодульВызовСервера.ЗначениеРеквизитаОбъекта(Сотрудник, "РаботникПроизводства");
	Если НЕ ЭтоРаботникПроизводства = Истина Тогда
		ТекстОшибки = "Данный сотрудник не является работником производства.
					|При необходимости установите соответствующий признак в карточке сотрудника";
		ПоказатьПредупреждение(, ТекстОшибки);
		Возврат Ложь;	
	КонецЕсли;
	
	Возврат Истина;
			
КонецФункции

&НаКлиенте
Процедура ВыполненЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = Неопределено Тогда
		Если ПроверитьЗаказНаПроизводствоПереведенВСтатусПроизведен(ЗаказНаПроизводство) Тогда
			//ДобавитьВИсторию("" + ЗаказНаПроизводство + " переведен в статус ""Произведен"".");
			ТекстСообщения = "" + ЗаказНаПроизводство + Символы.ПС + "с продукцией: " + НоменклатураПродукции + Символы.ПС + "переведен в статус ""ПРОИЗВЕДЕН""";
			//ПоказатьПредупреждение(, ТекстСообщения);
			ОткрытьФорму("ОбщаяФорма.ФормаПредупреждения", Новый Структура("ЗаголовокИнформации, ТекстИнформации, Состояние", "Успешная обработка", ТекстСообщения, "Успешно"));
			ОчиститьВсеПоляНаФорме();
		Иначе
			//ДобавитьВИсторию("При переводе " + ЗаказНаПроизводство + " в статус ""Произведен"" возникли ошибки, поля очищены не будут.");	
			ТекстСообщения = СтрШаблон("При переводе %1
								|в статус ""ПРОИЗВЕДЕН""
								|возникли ошибки: %2", 
										ЗаказНаПроизводство, 
										?(ТипЗнч(Результат) = Тип("Строка"), Символы.ПС + Результат, ""));
										
			//ПоказатьПредупреждение(,ТекстСообщения);							
			ОткрытьФорму("ОбщаяФорма.ФормаПредупреждения", Новый Структура("ЗаголовокИнформации, ТекстИнформации, Состояние", "Ошибка", ТекстСообщения, "Ошибка"));			
			
			ОчиститьВсеПоляНаФорме();
		КонецЕсли;	
		Оповестить("ОбновитьАРМПроизводства",,"ЗаказНаПроизводство");
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("УстановитьТекущийЭлемент", 0.1, Истина);
	
КонецПроцедуры

&НаСервере
Функция ПроверитьЗаказНаПроизводствоПереведенВСтатусПроизведен(ЗаказНаПроизводство) Экспорт
	
	ТекущийСтатусЗнП = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаказНаПроизводство, "ТекущийСтатус");
	Возврат ТекущийСтатусЗнП = Справочники.СтатусыЗаказовНаПроизводство.Произведен;
	
КонецФункции

&НаСервере
Функция ЗаполнитьЗаказНаПроизводствоНаСервере()
	
	ТекстОшибки = "";	
	ДокументОбъект = ЗаказНаПроизводство.ПолучитьОбъект();
		
	Если ПоПроизводственнымОперациям Тогда		
		
		ДокументОбъект.ИсполнителиПоОперациям.Очистить();
		Для Каждого ТекущаяСтрока Из ИсполнителиПоОперациям Цикл
			НоваяСтрока = ДокументОбъект.ИсполнителиПоОперациям.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			Если НЕ НоваяСтрока.Сотрудник1.Пустая() Тогда
				НоваяСтрока.Коэффициент1 = 1;
			КонецЕсли;
			Если НЕ НоваяСтрока.Сотрудник2.Пустая() Тогда
				НоваяСтрока.Коэффициент2 = 1;
			КонецЕсли;
			Если НЕ НоваяСтрока.Сотрудник3.Пустая() Тогда
				НоваяСтрока.Коэффициент3 = 1;
			КонецЕсли;
			Если НЕ НоваяСтрока.Сотрудник4.Пустая() Тогда
				НоваяСтрока.Коэффициент4 = 1;
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		
		ДокументОбъект.Исполнители.Очистить();
		Для Каждого ТекущаяСтрока Из Исполнители Цикл
			НоваяСтрока = ДокументОбъект.Исполнители.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			НоваяСтрока.Коэффициент = 1;
		КонецЦикла;
					
	КонецЕсли;
	
	//#16317
	Если МатериалыИзменены Тогда
		ДокументОбъект.Материалы.Загрузить(Материалы.Выгрузить());	
		ДокументОбъект.РучнаяКорректировкаМатериалов = Истина;
	КонецЕсли;
			
	Попытка
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Успешно = Истина;	
	Исключение
		//Сообщить("Не удалось записать документ при добавлении исполнителей: " + Символы.ПС + ОписаниеОшибки());
		//ДобавитьВИсторию("Не удалось записать документ при добавлении исполнителей: " + Символы.ПС + ОписаниеОшибки());
		ТекстОшибки = "Не удалось записать документ при добавлении исполнителей: " + Символы.ПС + ОписаниеОшибки();
		Успешно = Ложь;
	КонецПопытки;
	
	Возврат ТекстОшибки;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьИсполнителейПоЗаказуНаПроизводство()
	
	Исполнители.Очистить();
	ИсполнителиПоОперациям.Очистить();
	
	Если ПоПроизводственнымОперациям Тогда
		Для Каждого ТекСтрока Из ЗаказНаПроизводство.ИсполнителиПоОперациям Цикл
			НоваяСтрока = ИсполнителиПоОперациям.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		КонецЦикла;
	Иначе
		Для Каждого ТекСтрока Из ЗаказНаПроизводство.Исполнители Цикл
			НоваяСтрока = Исполнители.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМатериалыПоЗаказуНаПроизводство()
	
	//#16317
	Материалы.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗаказНаПроизводство", ЗаказНаПроизводство);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.НомерСтроки КАК НомерСтроки,
	|	ДанныеДокумента.Номенклатура КАК Номенклатура,
	|	ДанныеДокумента.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ДанныеДокумента.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ДанныеДокумента.Количество КАК Количество,
	|	ДанныеДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ДанныеДокумента.Коэффициент КАК Коэффициент,
	|	ДанныеДокумента.КоличествоКВыработке КАК КоличествоКВыработке,
	|	ДанныеДокумента.ЗагруженоИзПостроителя КАК ЗагруженоИзПостроителя,
	|	ДанныеДокумента.УИСтроки КАК УИСтроки
	|ИЗ
	|	Документ.ЗаказНаПроизводство.Материалы КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &ЗаказНаПроизводство
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Материалы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ДобавитьИсполнителяВСхемеПоОперациям()

	//сначала убедимся что по данной операции данного сотрудника еще нет
	Для Каждого ТекСтрока Из ИсполнителиПоОперациям Цикл
		Если ТекСтрока.Операция = ПроизводственнаяОперация Тогда
			Если ТекСтрока.Сотрудник1 = Сотрудник
				или ТекСтрока.Сотрудник2 = Сотрудник
				или ТекСтрока.Сотрудник3 = Сотрудник
				или ТекСтрока.Сотрудник4 = Сотрудник
				тогда
				ПроизводственнаяОперация = ПредопределенноеЗначение("Справочник.ПроизводственныеОперации.ПустаяСсылка");
				Сотрудник = ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка");
				Возврат "Данный сотрудник уже указан как исполнитель операции " + ПроизводственнаяОперация + " в данном заказе на производство";
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	//пытаемся добавить
	СтрокаОперации = Неопределено;
	Для Каждого ТекСтрока Из ИсполнителиПоОперациям Цикл
		Если ТекСтрока.Операция = ПроизводственнаяОперация Тогда
			СтрокаОперации = ТекСтрока;
		КонецЕсли;
	КонецЦикла;
	
	Если СтрокаОперации = Неопределено Тогда
		//такой операции еще нет, добавляем
		НоваяСтрока = ИсполнителиПоОперациям.Добавить();
		НоваяСтрока.Операция = ПроизводственнаяОперация;
		НоваяСтрока.Сотрудник1 = Сотрудник;
	Иначе
		//такая операция есть, проверяем что есть свободные места для добавления и добавляем
		Если СтрокаОперации.Сотрудник1.Пустая() Тогда
			СтрокаОперации.Сотрудник1 = Сотрудник;
		ИначеЕсли СтрокаОперации.Сотрудник2.Пустая() Тогда
			СтрокаОперации.Сотрудник2 = Сотрудник;
		ИначеЕсли СтрокаОперации.Сотрудник3.Пустая() Тогда
			СтрокаОперации.Сотрудник3 = Сотрудник;
		ИначеЕсли СтрокаОперации.Сотрудник4.Пустая() Тогда
			СтрокаОперации.Сотрудник4 = Сотрудник;
		Иначе
			ПроизводственнаяОперация = ПредопределенноеЗначение("Справочник.ПроизводственныеОперации.ПустаяСсылка");
			Сотрудник = ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка");
			Возврат "Для операции " + ПроизводственнаяОперация + " в данном заказе на производство указано максимально воможное количество исполнителей";
		КонецЕсли;
	КонецЕсли;
	
	ПроизводственнаяОперация = ПредопределенноеЗначение("Справочник.ПроизводственныеОперации.ПустаяСсылка");
	Сотрудник = ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка");
	
КонецФункции

&НаСервере
Функция ДобавитьИсполнителяВБригаднойСхеме()
	
	//сначала убедимся что такого исполнителя нет
	Для Каждого ТекСтрока Из Исполнители Цикл
		Если ТекСтрока.Сотрудник = Сотрудник Тогда
			Сотрудник = ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка");
			Возврат "Данный сотрудник уже указан в качестве исполнителя заказа на производство";
		КонецЕсли;
	КонецЦикла;
	
	//добавляем
	НоваяСтрока = Исполнители.Добавить();
	НоваяСтрока.Сотрудник = Сотрудник;
	Сотрудник = ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка");
	
КонецФункции

&НаКлиенте
Процедура ВыборДокументаФрагмент(СсылкаНаЗаказНаПроизводство)
	
	//ПроверитьСоответствиеЗаказаНаПроизводствоЗаказуПокупателя
	
	ЗаказПокупателяСсылка = ПолучитьСсылкуНаОснование(СсылкаНаЗаказНаПроизводство);
	
	//#14923 расширено условие
	Если ОбщийМодульВызовСервера.ЗаказНаПроизводствоСвязанСЗаказомПокупателя(СсылкаНаЗаказНаПроизводство) Тогда
	//Если ОснованиемЗаказаНаПроизводствоЯвляетсяЗаказПокупателя(СсылкаНаЗаказНаПроизводство) Тогда
	
		СтруктураПроверки = ОбщийМодуль.ЗаказНаПроизводствоСоответствуетЗаказуПокупателя(СсылкаНаЗаказНаПроизводство, ПолучитьСсылкуНаОснование(СсылкаНаЗаказНаПроизводство));
		Если НЕ СтруктураПроверки.Результат Тогда
			Если СтруктураПроверки.ЕстьПотолок Тогда
				
				СсылкаЗП = ПолучитьСсылкуНаОснование(СсылкаНаЗаказНаПроизводство);
				
				ДополнительныеПараметры = Новый Структура;
				ДополнительныеПараметры.Вставить("ЗаказНаПроизводство", СсылкаНаЗаказНаПроизводство);
				ДополнительныеПараметры.Вставить("ЗаказНаПроизводствоОснование", СсылкаЗП);
				ОписаниеОповещения = Новый ОписаниеОповещения("НачалоПерезаполненияЗаказаНаПроизводствоПоОснованию", ЭтотОбъект, ДополнительныеПараметры);
				
				//#14923
				//ПоказатьВопрос(ОписаниеОповещения, "Сведения по потолку и его производственным услугам в заказе покупателя, являющемся основанием, отличаются от данных в этом заказе на производство.
				//	|Необходимо предварительно перезаполнить текущий заказ на производство по документу-основанию.
				//	|Выполнить перезаполнение заказа на производство (документ будет автоматически записан)?", РежимДиалогаВопрос.ДаНет);
				
				ПараметрыФормыПросмотраРазличий = Новый Структура;
				ПараметрыФормыПросмотраРазличий.Вставить("МассивСравнения", СтруктураПроверки.МассивСравнения);
				
				ПараметрыФормыПросмотраРазличий.Вставить("Документ1", СсылкаЗП);
				ПараметрыФормыПросмотраРазличий.Вставить("Документ2", СсылкаНаЗаказНаПроизводство);
				ПараметрыФормыПросмотраРазличий.Вставить("МассивРазличийРеквизитов", СтруктураПроверки.МассивРазличийРеквизитов);
				ПараметрыФормыПросмотраРазличий.Вставить("ДоступноИзменениеПриНаличииВыпуска", СтруктураПроверки.ДоступноИзменениеПриНаличииВыпуска); 
				ПараметрыФормыПросмотраРазличий.Вставить("ЕстьВыпуск", СтруктураПроверки.ЕстьВыпуск); 
				ПараметрыФормыПросмотраРазличий.Вставить("ТолькоПросмотр", Ложь);
				
				ТекстСообщения = ОбщийМодульКлиент.ТекстВопросаПерезаполненииЗаказаНаПроизводствоПоОснованию(СтруктураПроверки);
				ПараметрыФормыПросмотраРазличий.Вставить("ТекстСообщения",    ТекстСообщения);
				
				ОткрытьФорму("ОбщаяФорма.ПросмотрРазличийДокументов", ПараметрыФормыПросмотраРазличий, ЭтотОбъект,,,,ОписаниеОповещения);
					
			Иначе
				//Сообщить("В заказе покупателя (основании) отсутствует данный потолок!");
				//ДобавитьВИсторию("В заказе покупателя (основании) отсутствует данный потолок!");
				ПоказатьПредупреждение(, "В " + СсылкаНаЗаказНаПроизводство + " отсутствует продукция " + НоменклатураПродукции);
				// остаемся на начальной странице
			КонецЕсли;
			
			Возврат;
		Иначе
			ВыборЗаказНаПроизводствоЗавершение(СсылкаНаЗаказНаПроизводство);
		КонецЕсли;
		
	Иначе
		ВыборЗаказНаПроизводствоЗавершение(СсылкаНаЗаказНаПроизводство);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНоменклатуруПродукцииИзЗаказаНаПроизводство(ЗаказНаПроизводство, НоменклатураПродукции, ПредставлениеПродукции)
	
	НоменклатураПродукции = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
	КоличествоПродукции = 0;
	ЕдиницаИзмеренияПродукции = Неопределено;
	
	РеквизитыЗаказа = Общегоназначения.ЗначенияРеквизитовОбъекта(ЗаказНаПроизводство, "ВидЗаказа, ПродукцияНоменклатура, ПродукцияНоменклатураКоличество, ПродукцияНоменклатураЕдиницаИзмерения"); 
	Если РеквизитыЗаказа.ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ПроизводствоПотолка Тогда
		НоменклатураПродукции = РеквизитыЗаказа.ПродукцияНоменклатура;
		КоличествоПродукции = РеквизитыЗаказа.ПродукцияНоменклатураКоличество;
		ЕдиницаИзмеренияПродукции = РеквизитыЗаказа.ПродукцияНоменклатураЕдиницаИзмерения;
	ИначеЕсли РеквизитыЗаказа.ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ТиповоеПроизводство Тогда
		Если ЗаказНаПроизводство.Продукция.Количество() > 0 Тогда
			СтрокаПродукции = ЗаказНаПроизводство.Продукция[0];
			НоменклатураПродукции = СтрокаПродукции.Номенклатура;
			КоличествоПродукции = СтрокаПродукции.Количество;
			ЕдиницаИзмеренияПродукции = СтрокаПродукции.ЕдиницаИзмерения;
		КонецЕсли;
	КонецЕсли;	
	
	ПредставлениеПродукции = СтрШаблон("%1 (%2 %3)", НоменклатураПродукции, КоличествоПродукции, ЕдиницаИзмеренияПродукции);
	
КонецФункции

&НаСервере
Функция ПолучитьСсылкуНаОснование(СсылкаНаЗаказНаПроизводство)
	
	ДокументОснованиеЗнП = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаЗаказНаПроизводство, "ДокументОснование");
	Возврат ДокументОснованиеЗнП;
	
КонецФункции

&НаСервере
Функция ПолучитьЗаказНаПроизводство(Знач НомерРасчета)
	
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказНаПроизводство.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА ЗаказНаПроизводство.СпособНачисленияВыработки = Значение(Перечисление.СпособыНачисленияВыработки.ПроизводственныеОперации)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПоПроизводственнымОперациям
	|ИЗ
	|   Документ.ЗаказНаПроизводство КАК ЗаказНаПроизводство
	|ГДЕ
	|	ЗаказНаПроизводство.ПродукцияНомерРасчета ПОДОБНО &НомерРасчета
	|	И ЗаказНаПроизводство.ТекущийСтатус = Значение(Справочник.СтатусыЗаказовНаПроизводство.ВПроизводстве)
	|	И ЗаказНаПроизводство.Проведен
	|";
	Запрос.УстановитьПараметр("НомерРасчета", НомерРасчета);
	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда
		
		ПоПроизводственнымОперациям = Выборка.ПоПроизводственнымОперациям; // №14141
		
		Возврат Выборка.Ссылка;
				
	Иначе
		
		Возврат Документы.ЗаказНаПроизводство.ПустаяСсылка();
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура НачалоПерезаполненияЗаказаНаПроизводствоПоОснованию(Результат, ДопПараметры) Экспорт
	
	//Если Результат = КодВозвратаДиалога.Да Тогда		
	Если Результат = Истина Тогда
			
		СтруктураПотолка = ПолучитьПотолокЗаказаНаПроизводство(ДопПараметры.ЗаказНаПроизводство);		
		СтруктураВозврата = ОбновитьЗаказНаПроизводствоПоПотолкуПоЗаказуПокупателяНаСервере(ДопПараметры.ЗаказНаПроизводство, СтруктураПотолка.Потолок, ДопПараметры.ЗаказНаПроизводствоОснование, СтруктураПотолка.УИСтроки);	
		ЗаказНаПроизводство = СтруктураВозврата.ЗаказНаПроизводство;
		//ДобавитьВИсторию(СтруктураВозврата.ТекстСообщения);
		Если НЕ ПустаяСтрока(СтруктураВозврата.ТекстСообщения) Тогда
			ПоказатьПредупреждение(,СтруктураВозврата.ТекстСообщения);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЗаказНаПроизводство) Тогда
			ВыборЗаказНаПроизводствоЗавершение(ЗаказНаПроизводство);
		КонецЕсли;
	КонецЕсли;
	
	//ОбновитьСостояние();

КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбновитьЗаказНаПроизводствоПоПотолкуПоЗаказуПокупателяНаСервере(Знач СсылкаЗаказНаПроизводство, Знач Потолок, Знач ЗаказНаПроизводствоОснование, Знач УИСтроки)
	
	СтруктураВозврата = Новый Структура("ЗаказНаПроизводство, ТекстСообщения", Документы.ЗаказНаПроизводство.ПустаяСсылка(), "");
	
	УспешноПроведен = Ложь;
	//#14923 вызываем единую функцию перезаполнения ЗНП
	//ОбщийМодуль.ОбновитьЗаказНаПроизводствоПоПотолкуПоЗаказуПокупателя(СсылкаЗаказНаПроизводство, Потолок, ЗаказНаПроизводствоОснование, УспешноПроведен, УИСтроки);
	ОбщийМодуль.ОбновитьЗаказНаПроизводствоПоЗаказуПокупателя(СсылкаЗаказНаПроизводство, , УспешноПроведен);
	Если УспешноПроведен Тогда
		//Сообщить("Заказ на производство перезаполнен");		
		СтруктураВозврата.ЗаказНаПроизводство = СсылкаЗаказНаПроизводство;
		СтруктураВозврата.ТекстСообщения = "Заказ на производство перезаполнен";
	Иначе	
		//Сообщить("Заказ на производство " + СсылкаЗаказНаПроизводство + " не был успешно перезаполнен. Выбор отменен.");
		СтруктураВозврата.ТекстСообщения = "Заказ на производство " + СсылкаЗаказНаПроизводство + " не был успешно перезаполнен. Выбор отменен.";
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции	

&НаСервере
Функция ПолучитьПотолокЗаказаНаПроизводство(СсылкаНаЗаказНаПроизводство)
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("Потолок",Справочники.Номенклатура.ПустаяСсылка());
	СтруктураОтвета.Вставить("УИСтроки","");
	
	Если СсылкаНаЗаказНаПроизводство.ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ПроизводствоПотолка Тогда
		
		СтруктураОтвета.Вставить("Потолок",СсылкаНаЗаказНаПроизводство.ПродукцияНоменклатура);
		СтруктураОтвета.Вставить("УИСтроки",СсылкаНаЗаказНаПроизводство.ПродукцияУИСтроки);

	КонецЕсли;
	
	Возврат СтруктураОтвета;
	
КонецФункции

&НаСервере
Функция ОснованиемЗаказаНаПроизводствоЯвляетсяЗаказПокупателя(СсылкаНаЗаказНаПроизводство)
	
	Если ТипЗнч(СсылкаНаЗаказНаПроизводство) = Тип("ДокументСсылка.ЗаказНаПроизводство") 
		И ТипЗнч(СсылкаНаЗаказНаПроизводство.ДокументОснование) = Тип("ДокументСсылка.ЗаказПокупателя")
		И НЕ СсылкаНаЗаказНаПроизводство.ДокументОснование.Пустая() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
			
КонецФункции

&НаСервере
Процедура СохранитьНастройкиФормы()

	ПользовательскийОтбор = Новый ОтборКомпоновкиДанных();
	
	ОбщийМодульСервер.НовыйОтбор(ПользовательскийОтбор, "ТекущийСтатус", ЗаказОтборПоТекущемуСтатусу); 
	ОбщийМодульСервер.НовыйОтбор(ПользовательскийОтбор, "Цех", ЗаказОтборПоЦеху);
	ОбщийМодульСервер.НовыйОтбор(ПользовательскийОтбор, "СкладМатериалов", ЗаказОтборПоСкладуМатериалов); //nva
	
	СтруктураНастроек = Новый Структура;	
	СтруктураНастроек.Вставить("НастройкиОтбораЗНП",  Новый ХранилищеЗначения(ПользовательскийОтбор));
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("РабочееМестоСотрудникаПроизводства", "НастройкиФормыСписка", СтруктураНастроек);
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройкиФормы()

	СтруктураНастроек = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("РабочееМестоСотрудникаПроизводства", "НастройкиФормыСписка");
	
	Если НЕ ТипЗнч(СтруктураНастроек) = Тип("Структура") Тогда
		Возврат;	
	КонецЕсли;
	
	ПользовательскийОтбор = СтруктураНастроек.НастройкиОтбораЗНП.Получить();	
	
	МассивРеквизитовСтатусыЗаказа = ПолучитьМассивРеквизитовСтатусыЗаказа(); 
	
	Для Каждого НастройкаОтбора Из ПользовательскийОтбор.Элементы Цикл
		
		Если НастройкаОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТекущийСтатус") Тогда		
			Для Каждого ЭлементСписка Из НастройкаОтбора.ПравоеЗначение Цикл 				
				Если НЕ МассивРеквизитовСтатусыЗаказа.Найти(ЭлементСписка.Значение.ИмяПредопределенныхДанных) = Неопределено Тогда					
					ЗаказОтборПоТекущемуСтатусу.Добавить(ЭлементСписка.Значение);					
					Элементы["ОтборСтатусЗаказа" + ЭлементСписка.Значение.ИмяПредопределенныхДанных].Пометка = Истина;					
				КонецЕсли;				
			КонецЦикла;
		КонецЕсли;
		
		Если НастройкаОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Цех") Тогда		
			Для Каждого ЭлементСписка Из НастройкаОтбора.ПравоеЗначение Цикл				
				НайденныеСтроки = КомандыЦехов.НайтиСтроки(Новый Структура("Цех", ЭлементСписка.Значение));
				Если НайденныеСтроки.Количество() > 0 Тогда					
					ЗаказОтборПоЦеху.Добавить(ЭлементСписка.Значение);					
					Элементы[НайденныеСтроки[0].ИмяКоманды].Пометка = Истина;					
				КонецЕсли;				
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Процедура ДобавитьКомандуИКнопкуОтбораПоЦеху(Цех, КодЦеха, Наименование, КраткоеПредставление)
	
	ИмяКоманды = "ОтборПоЦеху" + КодЦеха;
	ЗаголовокКоманды = ?(ПустаяСтрока(КраткоеПредставление), Наименование, КраткоеПредставление);
	КомандаФормы = Команды.Добавить(ИмяКоманды);
	//КомандаФормы.Подсказка = Подсказка; 
	КомандаФормы.Заголовок = ЗаголовокКоманды; 
	КомандаФормы.Отображение = ОтображениеКнопки.Текст;
	КомандаФормы.Действие = "ОтборПоЦехуНажатие";	
	
	ИмяРеквизита = ИмяКоманды;
	КнопкаФормы = Элементы.Добавить(ИмяРеквизита, Тип("КнопкаФормы"), Элементы.ГруппаЗаказОтборыЦех); 		
	КнопкаФормы.ИмяКоманды = ИмяКоманды;		
	КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	КнопкаФормы.Ширина = 15;
	КнопкаФормы.Высота = 4;
	
	
	НоваяСтрока = КомандыЦехов.Добавить();
	НоваяСтрока.Цех = Цех;
	НоваяСтрока.ИмяКоманды = ИмяКоманды;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзОстатков(Команда)
	
	Если Команда.Имя = "ИзОстатков" Тогда
		Элемент = Элементы.Материалы;
	ИначеЕсли Команда.Имя = "ИзОстатков1" Тогда
		Элемент = Элементы.Материалы1;
	КонецЕсли;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторСтроки = Элемент.ТекущаяСтрока;	
	ДополнительныеПараметры = Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТекстВопроса", "ЗАМЕНИТЬ ПОЛОТНА НА ОСТАТОК?");
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаменитьНаОстаток", ЭтотОбъект, ДополнительныеПараметры);	
	ОткрытьФорму("Обработка.РабочееМестоСотрудникаПроизводства.Форма.ФормаВопроса", ПараметрыФормы,,,,, ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьНаОстаток(РезультатОткрытияФормы, ДополнительныеПараметры) Экспорт
	Если РезультатОткрытияФормы = КодВозвратаДиалога.Да Тогда
        ЗаменитьНаМатериалЗаказчикаНаСервере(Истина, Истина);
	КонецЕсли;
	Если РезультатОткрытияФормы = КодВозвратаДиалога.Нет Тогда	
		ЗаменитьНаМатериалЗаказчикаНаСервере(Ложь, Истина);
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИзМатериалаЗаказчика(Команда)
	 Если Команда.Имя = "ИзМатериалаЗаказчика" Тогда
		Элемент = Элементы.Материалы;
	ИначеЕсли Команда.Имя = "ИзМатериалаЗаказчика1" Тогда
		Элемент = Элементы.Материалы1;
	КонецЕсли;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторСтроки = Элемент.ТекущаяСтрока;	
	ДополнительныеПараметры = Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТекстВопроса", "ЗАМЕНИТЬ ПОЛОТНА НА МАТЕРИАЛ ЗАКАЗЧИКА?");
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаменитьНаМатериалЗаказчика", ЭтотОбъект, ДополнительныеПараметры);	
	ОткрытьФорму("Обработка.РабочееМестоСотрудникаПроизводства.Форма.ФормаВопроса", ПараметрыФормы,,,,, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьНаМатериалЗаказчика(РезультатОткрытияФормы, ДополнительныеПараметры) Экспорт
	Если РезультатОткрытияФормы = КодВозвратаДиалога.Да Тогда
        ЗаменитьНаМатериалЗаказчикаНаСервере(Истина, Ложь);
	КонецЕсли;
	Если РезультатОткрытияФормы = КодВозвратаДиалога.Нет Тогда	
		ЗаменитьНаМатериалЗаказчикаНаСервере(Ложь, Ложь);
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаменитьНаМатериалЗаказчикаНаСервере(Заменить, Остаток) 
	ОбщийМодульСервер.ИзменитьПолотнаВМатериалах(ЭтотОбъект, Заменить, Остаток);
	МатериалыИзменены = Истина;
КонецПроцедуры	

&НаКлиенте
Процедура ОтправитьВсеВложенныеФайлыНаПринтер(Команда)
	Если НЕ Элементы.СписокЗаказов.ТекущиеДанные.Ссылка = Неопределено Тогда
		РаспечатаноВыполнитьСписок(Истина); 
		Элементы.СписокЗаказов.Обновить();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура РаспечатаноВыполнитьСписок(ЗначенияПризнака)
	
	ИмяТекущегоЭлемента = Элементы.СписокЗаказов.Имя;
	
	Если Не ВыборКорректен(ИмяТекущегоЭлемента) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЗаказНаПроизводство Из Элементы[ИмяТекущегоЭлемента].ВыделенныеСтроки Цикл
		ОбщийМодульКлиент.ОтправитьВсеВложенныеФайлыЗаказаНаПроизводствоНаПринтер(ЗаказНаПроизводство, ЗаказНаПроизводство.УникальныйИдентификатор());	
	КонецЦикла;
	
	РаспечатаноВыполнитьСписокНаСервере(ЗначенияПризнака, ИмяТекущегоЭлемента);
		
КонецПроцедуры 

&НаКлиенте
Функция ВыборКорректен(ИмяСписка, ПоТекущейСтроке = Ложь)
	
	ТипГруппировка = Тип("СтрокаГруппировкиДинамическогоСписка");
	Если ПоТекущейСтроке Тогда
		
		Если ТипЗнч(Элементы[ИмяСписка].ТекущаяСтрока) <> ТипГруппировка И Элементы[ИмяСписка].ТекущиеДанные <> Неопределено Тогда
			Возврат Истина;
		КонецЕсли;
		
	Иначе
		
		Для Каждого Элемент Из Элементы[ИмяСписка].ВыделенныеСтроки Цикл
			Если ТипЗнч(Элемент) <> ТипГруппировка Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура РаспечатаноВыполнитьСписокНаСервере(ЗначенияПризнака, ИмяТекущегоЭлемента)
	
	МассивЗаказовНаПроизводство = Новый Массив;

	Для Каждого ЗаказНаПроизводство Из Элементы[ИмяТекущегоЭлемента].ВыделенныеСтроки Цикл
		МассивЗаказовНаПроизводство.Добавить(ЗаказНаПроизводство);	
	КонецЦикла;
	
	УстановитьМеткуРаспечатано(МассивЗаказовНаПроизводство, Истина);
	
КонецПроцедуры 

&НаСервере
Процедура УстановитьМеткуРаспечатано(Знач ДанныеДляОбработки, Знач ЗначениеПризнака)
		
	Если ДанныеДляОбработки <> Неопределено Тогда
		
		МассивЗаказовНаПроизводство = Новый Массив;
		
		Для Каждого Заказ Из ДанныеДляОбработки Цикл
			Если ЗначениеЗаполнено(Заказ) Тогда
				МассивЗаказовНаПроизводство.Добавить(Заказ);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого Заказ Из МассивЗаказовНаПроизводство Цикл
			
			 ЗаписатьМеткуРаспечатано(Заказ);
			
		КонецЦикла;			
		
	КонецЕсли;
		
КонецПроцедуры 

&НаСервере
Процедура ЗаписатьМеткуРаспечатано(Заказ)
	
	Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |	NVA_МеткиОбъектов.Объект КАК Объект,
    |	NVA_МеткиОбъектов.Метка КАК Метка
    |ИЗ
    |	РегистрСведений.NVA_МеткиОбъектов КАК NVA_МеткиОбъектов
    |ГДЕ
    |	NVA_МеткиОбъектов.Объект = &Заказ";
    
    Запрос.УстановитьПараметр("Заказ", Заказ);

    Выборка = Запрос.Выполнить().Выбрать();
    Если НЕ Выборка.Следующий() Тогда
        ТекЗапись = РегистрыСведений.NVA_МеткиОбъектов.СоздатьМенеджерЗаписи();
        ТекЗапись.Объект = Заказ;
        ТекЗапись.Метка  = Истина;
        Попытка
            ТекЗапись.Записать();
        Исключение
        КонецПопытки;
    Иначе
		Если Выборка.Метка Тогда
			Возврат;
		КонецЕсли;	
		
		ТекЗапись = РегистрыСведений.NVA_МеткиОбъектов.СоздатьМенеджерЗаписи();
        ТекЗапись.Объект = Выборка.Объект;
        ТекЗапись.Прочитать();
        
        ТекЗапись.Метка  = Истина;
        Попытка
            ТекЗапись.Записать();
        Исключение
        КонецПопытки;

    КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
